app/controllers/home_controller.rb

  def top
    @event = Event.all
---
SELECT "events".* FROM "events"